{"format": "graph-model", "generatedBy": "2.17.0", "convertedBy": "TensorFlow.js Converter v4.21.0", "signature": {"inputs": {"inputs": {"name": "inputs:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block1_conv1_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block1_conv1_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block1_conv2_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block1_conv2_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block2_conv1_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block2_conv1_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block2_conv2_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block2_conv2_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block3_conv1_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block3_conv1_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block3_conv2_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block3_conv2_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block3_conv3_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block3_conv3_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block4_conv1_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block4_conv1_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block4_conv2_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block4_conv2_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block4_conv3_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block4_conv3_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block5_conv1_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block5_conv1_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block5_conv2_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block5_conv2_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block5_conv3_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block5_conv3_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/flatten_1/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "25088"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1_2/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1_2/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "inputs", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block1_conv1_1/Relu", "op": "_FusedConv2D", "input": ["inputs", "StatefulPartitionedCall/sequential_1/vgg16_1/block1_conv1_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_1/vgg16_1/block1_conv1_1/Reshape"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "num_host_args": {"i": "0"}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}, "leakyrelu_alpha": {"f": 0.2}, "filter_format": {"s": "SFdJTw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block1_conv2_1/add", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1/vgg16_1/block1_conv1_1/Relu", "StatefulPartitionedCall/sequential_1/vgg16_1/block1_conv2_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_1/vgg16_1/block1_conv2_1/Reshape"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "num_host_args": {"i": "0"}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "filter_format": {"s": "SFdJTw=="}, "leakyrelu_alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block1_pool_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1/vgg16_1/block1_conv2_1/add"], "attr": {"explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block1_conv2_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_1/vgg16_1/block1_pool_1/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block2_conv1_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1/vgg16_1/block1_conv2_1/Relu", "StatefulPartitionedCall/sequential_1/vgg16_1/block2_conv1_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_1/vgg16_1/block2_conv1_1/Reshape"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "filter_format": {"s": "SFdJTw=="}, "num_args": {"i": "1"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_host_args": {"i": "0"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block2_conv2_1/add", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1/vgg16_1/block2_conv1_1/Relu", "StatefulPartitionedCall/sequential_1/vgg16_1/block2_conv2_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_1/vgg16_1/block2_conv2_1/Reshape"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "leakyrelu_alpha": {"f": 0.2}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "filter_format": {"s": "SFdJTw=="}, "epsilon": {"f": 0.0}, "num_host_args": {"i": "0"}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block2_pool_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1/vgg16_1/block2_conv2_1/add"], "attr": {"padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block2_conv2_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_1/vgg16_1/block2_pool_1/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block3_conv1_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1/vgg16_1/block2_conv2_1/Relu", "StatefulPartitionedCall/sequential_1/vgg16_1/block3_conv1_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_1/vgg16_1/block3_conv1_1/Reshape"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.2}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_host_args": {"i": "0"}, "epsilon": {"f": 0.0}, "filter_format": {"s": "SFdJTw=="}, "use_cudnn_on_gpu": {"b": true}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block3_conv2_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1/vgg16_1/block3_conv1_1/Relu", "StatefulPartitionedCall/sequential_1/vgg16_1/block3_conv2_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_1/vgg16_1/block3_conv2_1/Reshape"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "num_host_args": {"i": "0"}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "leakyrelu_alpha": {"f": 0.2}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block3_conv3_1/add", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1/vgg16_1/block3_conv2_1/Relu", "StatefulPartitionedCall/sequential_1/vgg16_1/block3_conv3_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_1/vgg16_1/block3_conv3_1/Reshape"], "device": "/device:CPU:0", "attr": {"filter_format": {"s": "SFdJTw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "data_format": {"s": "TkhXQw=="}, "num_host_args": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block3_pool_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1/vgg16_1/block3_conv3_1/add"], "attr": {"T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block3_conv3_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_1/vgg16_1/block3_pool_1/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block4_conv1_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1/vgg16_1/block3_conv3_1/Relu", "StatefulPartitionedCall/sequential_1/vgg16_1/block4_conv1_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_1/vgg16_1/block4_conv1_1/Reshape"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "filter_format": {"s": "SFdJTw=="}, "leakyrelu_alpha": {"f": 0.2}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block4_conv2_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1/vgg16_1/block4_conv1_1/Relu", "StatefulPartitionedCall/sequential_1/vgg16_1/block4_conv2_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_1/vgg16_1/block4_conv2_1/Reshape"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "leakyrelu_alpha": {"f": 0.2}, "explicit_paddings": {"list": {}}, "filter_format": {"s": "SFdJTw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "num_host_args": {"i": "0"}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block4_conv3_1/add", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1/vgg16_1/block4_conv2_1/Relu", "StatefulPartitionedCall/sequential_1/vgg16_1/block4_conv3_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_1/vgg16_1/block4_conv3_1/Reshape"], "device": "/device:CPU:0", "attr": {"TArgs": {"list": {"type": ["DT_FLOAT"]}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "filter_format": {"s": "SFdJTw=="}, "T": {"type": "DT_FLOAT"}, "num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "leakyrelu_alpha": {"f": 0.2}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block4_pool_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1/vgg16_1/block4_conv3_1/add"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block4_conv3_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_1/vgg16_1/block4_pool_1/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block5_conv1_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1/vgg16_1/block4_conv3_1/Relu", "StatefulPartitionedCall/sequential_1/vgg16_1/block5_conv1_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_1/vgg16_1/block5_conv1_1/Reshape"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "num_host_args": {"i": "0"}, "filter_format": {"s": "SFdJTw=="}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block5_conv2_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1/vgg16_1/block5_conv1_1/Relu", "StatefulPartitionedCall/sequential_1/vgg16_1/block5_conv2_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_1/vgg16_1/block5_conv2_1/Reshape"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}, "num_host_args": {"i": "0"}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "leakyrelu_alpha": {"f": 0.2}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block5_conv3_1/add", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1/vgg16_1/block5_conv2_1/Relu", "StatefulPartitionedCall/sequential_1/vgg16_1/block5_conv3_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_1/vgg16_1/block5_conv3_1/Reshape"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_host_args": {"i": "0"}, "num_args": {"i": "1"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.2}, "filter_format": {"s": "SFdJTw=="}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block5_pool_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1/vgg16_1/block5_conv3_1/add"], "attr": {"T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block5_conv3_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_1/vgg16_1/block5_pool_1/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/flatten_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_1/vgg16_1/block5_conv3_1/Relu", "StatefulPartitionedCall/sequential_1/flatten_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/flatten_1/Reshape", "StatefulPartitionedCall/sequential_1/dense_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.2}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1_2/Add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/dense_1/Relu", "StatefulPartitionedCall/sequential_1/dense_1_2/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_1_2/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "leakyrelu_alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1_2/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_1/dense_1_2/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_1/dense_1_2/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1882}}, "weightsManifest": [{"paths": ["group1-shard1of21.bin", "group1-shard2of21.bin", "group1-shard3of21.bin", "group1-shard4of21.bin", "group1-shard5of21.bin", "group1-shard6of21.bin", "group1-shard7of21.bin", "group1-shard8of21.bin", "group1-shard9of21.bin", "group1-shard10of21.bin", "group1-shard11of21.bin", "group1-shard12of21.bin", "group1-shard13of21.bin", "group1-shard14of21.bin", "group1-shard15of21.bin", "group1-shard16of21.bin", "group1-shard17of21.bin", "group1-shard18of21.bin", "group1-shard19of21.bin", "group1-shard20of21.bin", "group1-shard21of21.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block1_conv1_1/convolution/ReadVariableOp", "shape": [3, 3, 3, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block1_conv1_1/Reshape", "shape": [1, 1, 1, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block1_conv2_1/convolution/ReadVariableOp", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block1_conv2_1/Reshape", "shape": [1, 1, 1, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block2_conv1_1/convolution/ReadVariableOp", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block2_conv1_1/Reshape", "shape": [1, 1, 1, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block2_conv2_1/convolution/ReadVariableOp", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block2_conv2_1/Reshape", "shape": [1, 1, 1, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block3_conv1_1/convolution/ReadVariableOp", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block3_conv1_1/Reshape", "shape": [1, 1, 1, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block3_conv2_1/convolution/ReadVariableOp", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block3_conv2_1/Reshape", "shape": [1, 1, 1, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block3_conv3_1/convolution/ReadVariableOp", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block3_conv3_1/Reshape", "shape": [1, 1, 1, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block4_conv1_1/convolution/ReadVariableOp", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block4_conv1_1/Reshape", "shape": [1, 1, 1, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block4_conv2_1/convolution/ReadVariableOp", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block4_conv2_1/Reshape", "shape": [1, 1, 1, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block4_conv3_1/convolution/ReadVariableOp", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block4_conv3_1/Reshape", "shape": [1, 1, 1, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block5_conv1_1/convolution/ReadVariableOp", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block5_conv1_1/Reshape", "shape": [1, 1, 1, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block5_conv2_1/convolution/ReadVariableOp", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block5_conv2_1/Reshape", "shape": [1, 1, 1, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block5_conv3_1/convolution/ReadVariableOp", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/vgg16_1/block5_conv3_1/Reshape", "shape": [1, 1, 1, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/flatten_1/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/Cast/ReadVariableOp", "shape": [25088, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/Add/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_1_2/Cast/ReadVariableOp", "shape": [256, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_1_2/Add/ReadVariableOp", "shape": [1], "dtype": "float32"}]}]}